
{
  "title":"Readings",
  "content":"Apostol, Tom M. Calculus, Volume 1: One-Variable Calculus, with An Introduction to Linear Algebra. Waltham, Mass: Blaisdell, 1967. ISBN: 9780471000051.\nAdditional course notes by James Raymond Munkres, Professor of Mathematics, Emeritus, are also provided. SES # TOPICS TEXTBOOK READINGS COURSE NOTES READINGS Real numbers 0 Proof writing and set theory I 2.1-2.4 1 Axioms for the real numbers I 3.1-3.7 2 Integers, induction, sigma notation I 4.1-4.6 Course Notes A 3 Least upper bound, triangle inequality I 3.8-3.10, I 4.8 Course Notes B 4 Functions, area axioms 1.2-1.10 The integral 5 Definition of the integral 1.12-1.17 6 Properties of the integral, Riemann condition Course Notes C 7 Proofs of integral properties 88-90, 113-114 Course Notes D 8 Piecewise, monotonic functions 1.20-1.21 Course Notes E Limits and continuity 9 Limits and continuity defined 3.1-3.4 Course Notes F 10 Proofs of limit theorems, continuity 3.5-3.7 11 Hour exam I 12 Intermediate value theorem 3.9-3.11 13 Inverse functions 3.12-3.14 Course Notes G 14 Extreme value theorem and uniform continuity 3.16-3.18 Course Notes H Derivatives 15 Definition of the derivative 4.3-4.4, 4.7-4.8 16 Composite and inverse functions 4.10, 6.20 Course Notes I 17 Mean value theorem, curve sketching 4.13-4.18 18 Fundamental theorem of calculus 5.1-5.3 Course Notes K 19 Trigonometric functions Course Notes L Elementary functions; integration techniques 20 Logs and exponentials 6.3-6.7, 6.12-6.16 Course Notes M 21 IBP and substitution 5.7, 5.9 Course Notes N 22 Inverse trig; trig substitution 6.21 23 Hour exam II 24 Partial fractions 6.23 Course Notes N Taylor\u0026rsquo;s formula and limits 25 Taylor\u0026rsquo;s formula 7.1-7.2 26 Proof of Taylor\u0026rsquo;s formula Course Notes O 27 L\u0026rsquo;Hopital\u0026rsquo;s rule and infinite limits 7.12-7.16 Course Notes P Infinite series 28 Sequences and series; geometric series 10.1-10.6, 10.8 (first page only) 29 Absolute convergence, integral test 10.11, 10.13, 10.18 30 Tests: comparison, root, ratio 10.12, 10.15 Course Notes Q 31 Hour exam III 32 Alternating series; improper integrals 10.17, 10.23 Series of functions 33 Sequences of functions, convergence 11.1-11.2 34 Power series 11.3-11.4 Course Notes R 35 Properties of power series Course Notes R 36 Taylor series 11.9 Course Notes S 37 Fourier series Course Notes T "}


