
{
  "title":"Lecture Notes",
  "content":"Below are the lecture notes for every lecture session along with links to the Mathlets used during lectures.\nLEC# TOPICS RELATED MATHLETS I. First-order differential equations 1 Direction fields, existence and uniqueness of solutions (PDF) Related Mathlet: Isoclines 2 Numerical methods (PDF) Related Mathlet: Euler\u0026rsquo;s method 3 Linear equations, models (PDF) 4 Solution of linear equations, integrating factors (PDF) 5 Complex numbers, roots of unity (PDF) 6 Complex exponentials; sinusoidal functions (PDF) Related Mathlets: Complex roots, Complex exponential 7 Linear system response to exponential and sinusoidal input; gain, phase lag (PDF) Related Mathlet: Trigonometric identity 8 Autonomous equations; the phase line, stability (PDF) Related Mathlet: Phase lines 9 Linear vs. nonlinear (PDF) 10 Exam I II. Second-order linear equations 11 Modes and the characteristic polynomial (PDF) 12 Good vibrations, damping conditions (PDF) Related Mathlet: Damped vibrations 13 Exponential response formula, spring drive (PDF) Related Mathlet: Harmonic frequency response: Variable input frequency 14 Complex gain, dashpot drive (PDF) Related Mathlet: Amplitude and phase: Second order II 15 Operators, undetermined coefficients, resonance (PDF) 16 Frequency response (PDF) Related Mathlets: Amplitude and phase: Second order II, Amplitude and phase: First order, Amplitude and phase: Second order III 17 LTI systems, superposition, RLC circuits (PDF) Related Mathlet: Series RLC circuit 18 Engineering applications (PDF)\nVideo of the guest lecture by Prof. Kim Vandiver 19 Exam II III. Fourier series 20 Fourier series (PDF) Related Mathlet: Fourier coefficients 21 Operations on fourier series (PDF) Related Mathlet: Fourier coefficients: Complex with sound 22 Periodic solutions; resonance (PDF) 23 Step functions and delta functions (PDF) 24 Step response, impulse response (PDF) 25 Convolution (PDF) Related Mathlets: Convolution: Accumulation, Convolution: Flip and drag 26 Laplace transform: basic properties (PDF) 27 Application to ODEs (PDF) 28 Second order equations; completing the squares (PDF) 29 The pole diagram (PDF) Related Mathlets: Amplitude response: Pole diagram, Poles and vibrations 30 The transfer function and frequency response (PDF) 31 Exam III IV. First order systems 32 Linear systems and matrices (PDF) 33 Eigenvalues, eigenvectors (PDF) Related Mathlets: Linear phase portrait: Matrix entry, Matrix vector 34 Complex or repeated eigenvalues (PDF) Related Mathlet: Linear phase portrait: Matrix entry 35 Qualitative behavior of linear systems; phase plane (PDF) Related Mathlets: Linear phase portrait: Matrix entry, Linear phase portrait: Cursor entry 36 Normal modes and the matrix exponential (PDF) 37 Nonlinear systems (PDF) 38 Linearization near equilibria; the nonlinear pendulum (PDF) 39 Limitations of the linear: limit cycles and chaos (PDF) Related Mathlet: Vector fields 41 Final exam "}


