
{
  "title":"Readings",
  "content":"Listed in the table below are reading assignments for each lecture session.\n[EP] refers to the course textbook: Edwards, C., and D. Penney. Elementary Differential Equations with Boundary Value Problems. 6th ed. Upper Saddle River, NJ: Prentice Hall, 2003. ISBN: 9780136006138\n[SN] refers to the \u0026ldquo;18.03 Supplementary Notes\u0026rdquo; written by Prof. Miller.\n[Notes] refers to the \u0026ldquo;18.03 Notes and Exercises\u0026rdquo; written by Prof. Mattuck.\nAlso listed are links to specially written Java™ applets, or Mathlets, that were used in the lecture session.\nSES # TOPICS READINGS AND RELATED MATHLETS I. First-order differential equations R1 Natural growth, separable equations [EP]: 1.1 and 1.4\nL1 Direction fields, existence and uniqueness of solutions [EP]: 1.2 and 1.3\n[Notes]: G.1 (PDF)\n[SN]: 1 (PDF)\nIsoclines Mathlet\nL2 Numerical methods [EP]: 6.1 and 6.2\n[Notes]: G.2 (PDF)\nEuler\u0026rsquo;s method Mathlet L3 Linear equations, models [EP]: 1.5\n[SN]: 2 (PDF) L4 Solution of linear equations, integrating factors [EP]: 1.5\n[SN]: 3 (PDF) L5 Complex numbers, roots of unity [SN]: 5 (PDF)\n[SN]: 6 (PDF)\n[Notes]: C.1-3 (PDF) L6 Complex exponentials; sinusoidal functions [SN]: 4 (PDF)\n[Notes]: C.4 (PDF) and IR.6 (PDF)\nComplex roots Mathlet\nComplex exponential Mathlet L7 Linear system response to exponential and sinusoidal input; gain, phase lag [SN]: 4 (PDF)\n[Notes]: IR.6 (PDF)\nTrigonometric identity Mathlet L8 Autonomous equations; the phase line, stability [EP]: 1.7 and 7.1\n[SN]: Appendix A (PDF)\nPhase lines Mathlet L9 Linear vs. nonlinear [SN]: Appendix C (PDF) II. Second-order linear equations L11 Modes and the characteristic polynomial [EP]: 2.1, 2.2, and 2.3 up to \u0026ldquo;Polynomial Operators\u0026rdquo;\n[SN]: 9 (PDF) L12 Good vibrations, damping conditions [EP]: 2.3 and 2.4\nDamped vibrations Mathlet L13 Exponential response formula, spring drive [EP]: 2.6, pp. 157-159\n[SN]: 7 (PDF) (for beats)\n[Notes]: O.1 (PDF)\nHarmonic frequency response: Variable input frequency Mathlet L14 Complex gain, dashpot drive [EP]: 2.6, pp. 165-167\n[SN]: 10 (PDF)\n[Notes]: O.1, 2, 4 (PDF)\nAmplitude and phase: Second order II Mathlet L15 Operators, undetermined coefficients, resonance [EP]: 2.5, pp. 144-153 and EP: 2.7\n[SN]: 8 (PDF)\n[SN]: 11 (PDF)\nL16 Frequency response [SN]: 14 (PDF)\nAmplitude and phase: Second order II Mathlet\nAmplitude and phase: First order Mathlet\nAmplitude and phase: Second order III Mathlet L17 LTI systems, superposition, RLC circuits. [SN]: Appendix B (PDF)\nSeries RLC circuit Mathlet L18 Engineering applications [SN]: 12 (PDF)\n[SN]: 13 (PDF)\n[Notes]: O.3 (PDF) III. Fourier series L20 Fourier series [EP]: 8.1\n[SN]: 16 (PDF)\nFourier coefficients Mathlet L21 Operations on fourier series [EP]: 8.2 and 8.3\nFourier coefficients: Complex with sound Mathlet L22 Periodic solutions; resonance [EP]: 8.3 and 8.4 L23 Step function and delta function [SN]: 17 (PDF) L24 Step response, impulse response [SN]: 18 (PDF)\n[Notes]: IR (PDF) L25 Convolution [SN]: 18 (PDF)\nConvolution: Accumulation Mathlet\nConvolution: Flip and drag Mathlet L26 Laplace transform: basic properties [EP]: 4.1 L27 Application to ODEs [EP]: 4.2 and 4.3\n[SN]: 20 (PDF)\n[Notes]: H L28 Second order equations; completing the squares [EP]: 4.5 and 4.6\n[SN]: 20 (PDF) L29 The pole diagram [EP]: 4.4\n[SN]: 22 (PDF)\n[SN]: 23 (PDF)\n18.03 Difference Equations and Z-Transforms (PDF)(Courtesy of Jeremy Orloff.)\nAmplitude response: Pole diagram Mathlet\nPoles and vibrations Mathlet L30 The Transfer function and frequency response IV. First order systems L32 Linear systems and matrices [EP]: 5.1-5.3\n[SN]: 25 (PDF)\n[Notes]: LS.1 (PDF) L33 Eigenvalues, eigenvectors [EP]: 5.4\n[Notes]: LS.2 (PDF)\nLinear phase portrait: Matrix entry Mathlet\nMatrix vector Mathlet L34 Complex or repeated eigenvalues [EP]: 5.4\n[Notes]: LS.3 (PDF)\nLinear phase portrait: Matrix entry Mathlet L35 Qualitative behavior of linear systems; phase plane [SN]: 26 (PDF)\nLinear phase portrait: Matrix entry Mathlet\nLinear phase portrait: Cursor entry Mathlet L36 Normal modes and the matrix exponential [EP]: 5.7\n[Notes]: LS.6 (PDF) L37 Nonlinear systems [EP]: 7.2 and 7.3\n[Notes]: LS.6 (PDF) L38 Linearization near equilibria; the nonlinear pendulum [EP]: 7.4 and 7.5\n[Notes]: GS (PDF)\n[SN]: Appendix B (PDF)\n[SN]: Appendix C (PDF) L39 Limitations of the linear: limit cycles and chaos Vector fields Mathlet "}


