
{
  "title":"Meet the TAs",
  "content":"« Previous | Next »\nMartina Balagovic\nHi, I am Martina. By now, I taught linear algebra classes in three universities and in many different flavors. I love algebra, and this is probably my favorite class to teach. It gives students the chance to soar into rigorous, abstract algebraic thinking, while being firmly grounded by its many examples. This way one can reason abstractly and then check one\u0026rsquo;s intuition and reasoning on small, very concrete examples. At the same time, one can explore numerous applications in engineering and computer science. I hope the examples we prepared for you will be useful!\nMartina Balagovic grew up in Zagreb, Croatia. She got her undergraduate degree from the University of Zagreb. She was a graduate student at MIT from 2007, earning a Ph.D. degree in 2011. She is currently a postdoc at the University of York in the UK. She is fascinated by algebra and does research in representation theory.\nLinan Chen\nHello, my name is Linan and I\u0026rsquo;m glad to meet you here. When I was a graduate student at MIT, I had this great opportunity to make some video sessions on solving linear algebra problems for Course 18.06. So, here I am, with the exercises I choose for you. I would like to show you how simple pictures of lines intersecting can give rise to matrices, and how matrices can help with problems from other subjects such as solving differential equations or calculating volumes. Besides, I believe you also notice from these videos that drawing the related picture can often speed up the problem solving process, and it\u0026rsquo;s important that you practice the skill of drawing such pictures. So, have fun with these exercises, and I hope you find them good supplements to the lectures.\nLinan Chen comes from Shenyang, a city in the northeast of China. After completing her B.A. in Mathematics from Tsinghua University, she continued her graduate study at MIT where she obtained her Ph.D. in Mathematics in 2011. Linan has been an instructor for various math courses, and for her teaching effort, she was awarded the Charles and Holly Housman Award for Excellence in Teaching from the Department of Mathematics at MIT in 2011. Linan also created six recitation sessions for this course in Mandarin Chinese. You can find them in the following sessions:\nThe Geometry of Linear Algebra Transposes, Permutations, Vector Spaces Determinant Formulas and Cofactors Cramer's Rule, Inverse Matrix and Volume Differential Equations and exp(At) Exam 2 Review Linan is currently a Postdoctoral Fellow at McGill University, and her main research interest lies in probability theory, as well as its applications in other disciplines.\nBenjamin Harris\nHey, I\u0026rsquo;m Ben and I taught recitations of 18.06: Linear Algebra at MIT in the spring of 2009 and the spring of 2010. In 18.06, I enjoyed helping students take apart matrices, whether it is with the PLU-factorization, the QR-decomposition, or eigenvalues and eigenvectors. Matrices and linear transformations occur naturally throughout science and math. I hope Gilbert Strang\u0026rsquo;s lectures and our recitation videos help you to pull apart these mathematical objects.\nBenjamin Harris is currently a postdoctoral researcher at Louisiana State University. He obtained his Ph.D. in Mathematics from MIT in 2011. His research concerns Lie groups and their representations. More specifically, he is interested in wave front cycles of tempered representations, Fourier transforms of nilpotent coadjoint orbits, irreducible characters, and branching laws for discrete series.\nAna Rita Pires\nMy name is Ana. In 2011 when I started as a postdoc at Cornell University, my first teaching assignment was\u0026hellip;Linear Algebra! I have taught 18.06 several times here at MIT, and Linear Algebra might be my favorite subject to teach, because it has so many neat ideas and interesting applications, all the while being fairly self-contained.\nAna grew up in Portugal and got her undergraduate degree there. She came to MIT in 2005 as a graduate student in mathematics and started her research on symplectic geometry.\nDavid Shirokoff\nHi, I\u0026rsquo;m Dave and welcome to 18.06. This course is a great backbone math class for any engineering or science student. For instance, many of the concepts covered will reappear in upper year courses and provide a stepping stone towards understanding \u0026ldquo;how things work\u0026rdquo;. I hope you enjoy the problems in the videos, and that they help provide further insight into the material!\nDavid Shirokoff grew up in Welland (ON) Canada and completed his undergrad at the University of Toronto. He recently finished his Ph.D. at MIT in applied math under the supervision of Ruben Rosales. His research interests are in applied differential equations, dynamical systems and numerical methods.\nNikola Kamburov\nHi, I am Nikola. I hope you find these recitation videos, supplementing Prof. Strang\u0026rsquo;s superb linear algebra lectures, helpful and illuminating. Good luck with your studies!\nNikola Kamburov is a Ph.D. student in the Department of Mathematics at MIT. He grew up in Bulgaria and he earned his bachelor\u0026rsquo;s degree in mathematics from Princeton University. His research focuses on nonlinear partial differential equations.\n« Previous | Next »\n"}


