
{
  "title":"Syllabus",
  "content":" Course Meeting Times: Lectures: 2 sessions / week, 1 hour / session\nRecitations: 1 session / week, 1 hour / session\nPrerequisites There are no prerequisites for this course, although some calculus at the level of 18.01 Single Variable Calculus will be used. Format This course is offered in two alternative formats. Both formats use the same materials, cover the same topics, and have the same required homework and exams. Lecture-Recitation: Students attend two one-hour lectures by Prof. Gruber, as well as a one-hour recitation. During recitations, instructors will introduce new material, and not simply review past assignments. Recitation Only: Students attend three one-hour sessions each week. Recitations are taught by graduate students but are organized to closely follow the lecture material so that there is little variation in content or teaching style between sections. Choosing an Option: During the first two weeks of the semester, students may switch between formats. At the due date of the first homework, students must declare which section they are in, by attending section and signing in. This will automatically enroll them in that choice. Thereafter a student can change only with special faculty approval. If sessions are extremely unbalanced, the faculty reserves the right to reassign students.\nTextbook There is no formal textbook for the course. If students are interested in further reading, they can look at the following book:\nPerloff, Jeffrey M. Microeconomics, 7th Edition. Addison-Wesley, 2012. ISBN: 9780133456912. Course Requirements and Grading Activity Percentage Problem Sets 25% Midterm Exam 25% Final Exam 50% Problem Sets There will be 10 mandatory problem sets which will be individually graded and returned to the students. At the end of the term, students will have the nine best homework grades cumulated and this will count for 25% of the final course grade.\nExams There will be one mid-term exam held. This will be 2 hours long, and will count as 25% of the grade. There will also be a three-hour final during finals period, which will be cumulative and cover all of the course materials. This will count as the remaining 50% of the grade. Individual versus Joint Work All assignments, including homework and exams, will be submitted and graded individually. Students may work together on problem sets, but they all have to individually write up the answer. Also, collaboration during exams will be considered a breach of academic honesty.\n"}


