
{
  "title":"Related Resources",
  "content":" Professor Strang\u0026rsquo;s Related Courses on OCW Professor Strang\u0026rsquo;s foundational course 18.06 Linear Algebra has long been one of the most popular courses on OCW. It has received more than 10 million visits since its first publication in 2002. Professor Strang also has a website dedicated to his linear algebra teaching.\nProfessor Strang has continued to offer new insights into key mathematics subjects. In 2014, he published the new textbook Differential Equations and Linear Algebra. In 2016, that textbook was developed into a series of 55 short videos supported by MathWorks, with parallel videos about numerical solutions by Dr. Cleve Moler, the creator of MATLAB®. The textbook and video lectures help students in a basic ordinary differential equations course. This new series, Learn Differential Equations: Up Close with Gilbert Strang and Cleve Moler, is also available on the MathWorks website.\nIn 2017, Professor Strang launched a new undergraduate course at MIT: 18.065 Matrix Methods in Data Analysis, Signal Processing, and Machine Learning. Published on the OCW site in 2019, the course uses linear algebra concepts for understanding and creating machine learning algorithms, especially as applied to deep learning and neural networks. This course reviews linear algebra with applications to probability and statistics and optimization and, above all, a full explanation of deep learning. Professor Strang\u0026rsquo;s latest course on the topic is A 2020 Vision of Linear Algebra. These six brief videos contain ideas and suggestions from Professor Strang about the recommended order of topics in teaching and learning linear algebra. The first topic is called A New Way to Start Linear Algebra. That leads to The Column Space of a Matrix. The remaining videos outline very briefly the full course: The Big Picture of Linear Algebra; Orthogonal Vectors; Eigenvalues \u0026amp; Eigenvectors; and Singular Values \u0026amp; Singular Vectors.\nProfessor Strang\u0026rsquo;s Related Textbooks, Notes, and Videos Strang, Gilbert. Introduction to Linear Algebra. 5th ed. 2016. Wellesley-Cambridge Press.ISBN: 9780980232776.\nStrang, Gilbert. Linear Algebra and Learning from Data. 2019. Wellesley-Cambridge Press. ISBN: 9780692196380.\nStrang, Gilbert. Linear Algebra for Everyone. 2020. Wellesley-Cambridge Press. ISBN: 9781733146630.\nStrang, Gilbert. Differential Equations and Linear Algebra. 2014. Wellesley-Cambridge Press.ISBN: 9780980232790.\nZoomNotes for Linear Algebra (PDF). Professor Strang created these notes in 2020 and 2021 when many MIT classes were moved online (using Zoom) due to the COVID-19 Pandemic. He hopes that faculty who are planning a linear algebra course and students who are reading for themselves will see these notes.\nGuest speaker at the weekly OLSUME (Online Seminar on Undergraduate Mathematics Education) on the topic Linear Algebra and Deep Learning (MP4)\n\u0026ldquo;Linear Algebra, Teaching, and MIT OpenCourseWare\u0026rdquo; (YouTube) on Lex Fridman Podcast\n"}


