
{
  "title":"Syllabus",
  "content":" Course Meeting Times Lectures: 3 sessions / week, 1 hour / session\nRecitations: 2 sessions / week, 1 hour / session\nPrerequisites/Corequisites 18.03 Differential Equations has 18.01 Single Variable Calculus as a prerequisite. 18.02 Multivariable Calculus is a corequisite, meaning students can take 18.02 and 18.03 simultaneously.\nTexts Edwards, C., and D. Penney. Elementary Differential Equations with Boundary Value Problems. 6th ed. Upper Saddle River, NJ: Prentice Hall, 2003. ISBN: 9780136006138.\nNote: The 5th Edition (ISBN: 9780131457744) will serve as well.\nStudents also need two sets of notes \u0026ldquo;18.03: Notes and Exercises\u0026rdquo; by Arthur Mattuck, and \u0026ldquo;18.03 Supplementary Notes\u0026rdquo; by Haynes Miller.\nDescription This course is a study of Ordinary Differential Equations (ODE\u0026rsquo;s), including modeling physical systems.\nTopics include:\nSolution of First-order ODE\u0026rsquo;s by Analytical, Graphical and Numerical Methods; Linear ODE\u0026rsquo;s, Especially Second Order with Constant Coefficients; Undetermined Coefficients and Variation of Parameters; Sinusoidal and Exponential Signals: Oscillations, Damping, Resonance; Complex Numbers and Exponentials; Fourier Series, Periodic Solutions; Delta Functions, Convolution, and Laplace Transform Methods; Matrix and First-order Linear Systems: Eigenvalues and Eigenvectors; and Non-linear Autonomous Systems: Critical Point Analysis and Phase Plane Diagrams. Format The lecture period is used to help students gain expertise in understanding, constructing, solving, and interpreting differential equations. Students must come to lecture prepared to participate actively. At the first recitation, students are given a set of flashcards to bring to each lecture. They are used during class sessions to vote on answers to questions posed occasionally in the lecture. In case of divided opinions, a discussion follows. As a further element of active participation in class, students will often be asked to spend a minute responding to a short feedback question at the end of the lecture.\nRecitations These small groups meet twice a week to discuss and gain experience with the course material. Even more than the lectures, the recitations involve active participation. The recitation leader may begin by asking for questions or hand out problems to work on in small groups. Students are encouraged to ask questions early and often. Recitation leaders also hold office hours.\nTutoring Another resource of great value to students is the tutoring room. This is staffed by experienced undergraduates. Extra staff is added before hour exams. This is a good place to go to work on homework.\nThe Ten Essential Skills Students should strive for personal mastery over the following skills. These are the skills that are used in other courses at MIT. This list of skills is widely disseminated among the faculty teaching courses listing 18.03 as a prerequisite. At the moment, 140 courses at MIT list 18.03 as a prerequisite or a corequisite.\nModel a simple system to obtain a first order ODE. Visualize solutions using direction fields and isoclines, and approximate them using Euler\u0026rsquo;s method. Solve a first order linear ODE by the method of integrating factors or variation of parameter. Calculate with complex numbers and exponentials. Solve a constant coefficient second order linear initial value problem with driving term exponential times polynomial. If the input signal is sinusoidal, compute amplitude gain and phase shift. Compute Fourier coefficients, and find periodic solutions of linear ODEs by means of Fourier series. Utilize Delta functions to model abrupt phenomena, compute the unit impulse response, and express the system response to a general signal by means of the convolution integral. Find the weight function or unit impulse response and solve constant coefficient linear initial value problems using the Laplace transform together with tables of standard values. Relate the pole diagram of the transfer function to damping characteristics and the frequency response curve. Calculate eigenvalues, eigenvectors, and matrix exponentials, and use them to solve first order linear systems. Relate first order systems with higher-order ODEs. Recreate the phase portrait of a two-dimensional linear autonomous system from trace and determinant. Determine the qualitative behavior of an autonomous nonlinear two-dimensional system by means of an analysis of behavior near critical points. The Ten Essential Skills is also available as a (PDF).\nHomework Each homework assignment has two parts: a first part drawn from the book or notes, and a second part consisting of problems which will be handed out. Both parts are keyed closely to the lectures. Students should form the habit of doing the relevant problems between successive lectures and not try to do the whole set the night before they are due.\nExams There are 3 one-hour exams held during lecture session and a three-hour comprehensive final examination.\nGrading The final grade will be based on a cumulative total of 885 points computed as follows:\nACTIVITIES POINTS Nine homework assignments 225 Three hour exams 300 One final exam 360 ODE Manipulatives (\u0026ldquo;Mathlets\u0026rdquo;) This course employs a series of specially written Java™ applets, or Mathlets. They are used in lecture occasionally, and each problem set contains a problem based around one or another of them.\n"}


