
{
  "title":"Syllabus",
  "content":" Course Meeting Times Lectures: 3 sessions / week, 1 hour / session\nRecitations: 2 sessions / week, 1 hour / session\nTextbook Apostol, Tom M. Calculus, Volume 1: One-Variable Calculus, with An Introduction to Linear Algebra. Waltham, Mass: Blaisdell, 1967. ISBN: 9780471000051.\n(Vol. 2 will be needed for those who wish to continue on to 18.024 Multivariable calculus with theory.)\nAdditional course notes by James Raymond Munkres, Professor of Mathematics, Emeritus, are also provided.\nPrerequisites We will assume a working knowledge of Calculus I (18.01 Single Variable Calculus), but no familiarity with proofs or proof writing.\nDescription We will cover the same material as 18.01 but with an emphasis on proofs and conceptual understanding rather than computation. Topics include:\nAxioms for the real numbers; The Riemann integral; Limits, theorems on continuous functions; Derivatives of functions of one variable; The fundamental theorems of calculus; Taylor\u0026rsquo;s theorem; Infinite series, power series, rigorous treatment of the elementary functions. Recitation Assignments At the beginning of each unit, students will receive a schedule that includes problems to complete in advance of the next recitation. Students should be prepared to present their proofs in clear detail. This will give them the opportunity to very deliberately improve their proof writing skills.\nProblem Sets Problem sets are assigned weekly, and due the following week. At the end of the course, the lowest two pset scores for each student will be replaced by his or her average score on all of the psets.\nExams There will be three in-class, one hour exams, and one three-hour comprehensive final exam.\nGrading ACTIVITIES PERCENTAGES Problem sets 20% Midterms 40% Final exam 30% Participation 10% Calendar LEC # TOPICS KEY DATES Real numbers 0 Proof writing and set theory 1 Axioms for the real numbers 2 Integers, induction, sigma notation 3 Least upper bound, triangle inequality 4 Functions, area axioms The integral 5 Definition of the integral Pset1 due 6 Properties of the integral, Riemann condition 7 Proofs of integral properties 8 Piecewise, monotonic functions Pset2 due Limits and continuity 9 Limits and continuity defined 10 Proofs of limit theorems, continuity Pset3 due 11 Hour exam I Covers lectures 1-9 12 Intermediate value theorem 13 Inverse functions 14 Extreme value theorem and uniform continuity Pset4 due Derivatives 15 Definition of the derivative 16 Composite and inverse functions 17 Mean value theorem, curve sketching Pset 5 due 18 Fundamental theorem of calculus 19 Trigonometric functions Elementary functions; integration techniques 20 Logs and exponentials Pset 6 due 21 IBP and substitution 22 Inverse trig; trig substitution Pset 7 due 23 Hour exam II Covers lectures 10-20 24 Partial fractions Taylor\u0026rsquo;s formula and limits 25 Taylor\u0026rsquo;s Formula 26 Proof of Taylor\u0026rsquo;s formula Pset 8 due 27 L\u0026rsquo;Hopital\u0026rsquo;s rule and infinite limits Infinite series 28 Sequences and series; geometric series Pset 9 due 29 Absolute convergence, integral test 30 Tests: comparison, root, ratio Pset 10 due 31 Hour exam III Covers lectures 21-29 32 Alternating series; improper integrals Series of functions 33 Sequences of functions, convergence 34 Power series 35 Properties of power series Pset 11 due 36 Taylor series 37 Fourier series 38 Final exam "}


